<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>

<script type='text/javascript'> 
window.onpageshow =  function(event) {
    //back 이벤트 일 경우
    if (event.persisted) {
    		//todo
    		window.location.reload();
    }
}
window.onload = function(){ 
	if(navigator.userAgent.match(/inapp|NAVER|KAKAOTALK|Snapchat|Line|WirtschaftsWoche|Thunderbird|Instagram|everytimeApp|WhatsApp|Electron|wadiz|AliApp|zumapp|iPhone(.*)Whale|Android(.*)Whale|kakaostory|band|twitter|DaumApps|DaumDevice\/mobile|FB_IAB|FB4A|FBAN|FBIOS|FBSS|SamsungBrowser\/[^1]/i))
	{ 
		document.body.innerHTML = ''; 
		if(navigator.userAgent.match(/iPhone|iPad/i)){ 
			window.open(location.href, "_self");
		}else{ 
			location.href='intent://'+location.href.replace(/https?:\/\//i,'')+'#Intent;scheme=http;package=com.android.chrome;end'; 
		} 
	} 
} 
</script>
	

<style>
    
    .info {
       
    display: block;
    padding: 20px;
        width: 60%;
    height: 380px;
    background: #E8E6E7;
    text-align: center;
        margin:auto;
        
    } 
    
    </style> 
    
    
    
    
 <div style = "margin-top:150px; text-align:center;">
 
 <h1 align="CENTER" style="color:#0081ff;"> <!-- h1 사이즈로 내용 출력  -->

정비 협력업체 안내

</h1>
   <br>
     <br>
     <br>
     <br>

     
     <select name="addressRegion" id="addressRegion"></select>
<select name="addressDo" id="addressDo"></select>
<select name="addressSiGunGu" id="addressSiGunGu"></select>
<select name="addressDong" id="addressDong"></select>

<br/>
<br/>
<br/>

<span id="branch"></span>

<!--<select onchange="categoryChange(this)">
	<option>지역을 선택해주세요.</option>
	<option value="a">서울</option>
	<option value="b">경기</option>
	<option value="c">대구</option>
</select>

<select id="good">
<option>나머지 지역을 선택해주세요.</option>
</select> --> 
     
     
     <br><br>
     
     
     <div style="text-align:center;">
     <div class="info">
     
         <h2 align="CENTER" style="color:#053683; margin-top:15px;"> 자차 자기부담금 및 보험조건 안내 </h2>
         <br>
          
         <h3 align="CENTER" style="color:#053683; "> 자차 자기부담금 </h3> <br>
     
         <p style="font-size:15px;">
     → 과실에 따른 자차 수리비 총액의 30%  [최소 50만원 ~ 최대 200만원] <br>
     예시) 수리비 총액 100만원, 당사 과실 100%일 경우 <br>

     100만원 x 100% (과실) x 30% (자부담비율) = 30만원이나 최소 금액인 50만원을 부담해야 합니다.
             <br><br> </p>
             
         <h3 align="CENTER" style="color:#053683; "> 보험조건 </h3> <br>        
<p style="font-size:15px;">
기본조건 - 만 26세 이상 ~만 69세 이하,  운전경력 1년 이상 <br>

운전자 범위 - 개인 : 법적 배우자, 직계존속 (부모님),직계비속(자녀), 법인:  대표/임직원 <br><br>

※단, 범위 내 운전자는기본조건이 충족되어야 합니다. 
</p>
     
     </div>
     </div>
    
    
</div>
    
<script>
    
function categoryChange(e) {
	var good_a = ["성동구", "도봉구"];
	var good_b = ["고양시", "포천시", "수원시", "부천시", "안산시" ];
	var good_c = ["서구"];
	var target = document.getElementById("good");

	if(e.value == "a") var d = good_a;
	else if(e.value == "b") var d = good_b;
	else if(e.value == "c") var d = good_c;

	target.options.length = 0;

	for (x in d) {
		var opt = document.createElement("option");
		opt.value = d[x];
		opt.innerHTML = d[x];
		target.appendChild(opt);
	}	
}    
    
    
    
    
    
    
    </script> 
    
    
    
    
    
<script>
        $(function(){
            areaSelectMaker("#addressRegion", "#addressDo", "#addressSiGunGu", "#addressDong");
        });

        var areaSelectMaker = function(a1, a2, a3, a4){
            if(a1 == null || a2 == null || a3 == null){
                console.warn("Unkwon Area Tag");
                return;
            }

            var area = {
                "하모니협력업체" :{
                    "서울특별시" : { "중랑구" : {"대성자동차공업사" : "ds"},  "성북구" : {"대성자동차공업사" : "ds"}, "강북구" : {"대성자동차공업사" : "ds"}, "도봉구" : {"대성자동차공업사" : "ds"}, "노원구" : {"대성자동차공업사" : "ds"}, "양천구" : {"1급 불루모터스" : "blue"}, "강서구" : {"1급 불루모터스" : "blue"}, "구로구" : {"1급 불루모터스" : "blue"}, "금천구" : {"1급 불루모터스" : "blue"}, "영등포구" : {"1급 불루모터스" : "blue"}, "종로구" : {"메가모터스" : "mg"}, "중구" : {"메가모터스" : "mg"}, "용산구" : {"메가모터스" : "mg"}, "성동구" : {"메가모터스" : "mg"}, "광진구" : {"메가모터스" : "mg"}, "동대문구" : {"메가모터스" : "mg"}, "서대문구" : {"메가모터스" : "mg"}, "마포구" : {"메가모터스" : "mg"}, "동작구" : {"메가모터스" : "mg"}, "관악구" : {"메가모터스" : "mg"}, "서초구" : {"메가모터스" : "mg"}, "강남구" : {"메가모터스" : "mg"}, "송파구" : {"메가모터스" : "mg"}, "강동구" : {"메가모터스" : "mg"}, "은평구" : {"M모터스" : "M"}},
                    "부산광역시" : { "중구" : {"대주모터스" : "gm"}, "서구" : {"대주모터스" : "gm"}, "동구" : {"대주모터스" : "gm"}, "영도구" : {"대주모터스" : "gm"}, "부산진구" : {"대주모터스" : "gm"}, "동래구" : {"대주모터스" : "gm"}, "남구" : {"대주모터스" : "gm"}, "북구" : {"대주모터스" : "gm"}, "해운대구" : {"대주모터스" : "gm"}, "사하구" : {"대주모터스" : "gm"}, "금정구" : {"대주모터스" : "gm"}, "강서구" : {"대주모터스" : "gm"}, "연제구" : {"대주모터스" : "gm"}, "수영구" : {"대주모터스" : "gm"}, "사상구" : {"대주모터스" : "gm"} },
                    "대구광역시" : { "중구" : {"신원모터스" : "so"}, "동구" : {"신원모터스" : "so"}, "서구" : {"신원모터스" : "so"}, "남구" : {"신원모터스" : "so"},
                    "북구" : {"신원모터스" : "so"}, "수성구" : {"신원모터스" : "so"}, "달서구" : {"신원모터스" : "so"}, "달성군" : {"신원모터스" : "so"}},
                    "인천광역시" : { "중구" : {"서일자동차공업사" : "seoil"}, "동구" : {"서일자동차공업사" : "seoil"}, "미추홀구" : {"서일자동차공업사" : "seoil"}, "연수구" : {"서일자동차공업사" : "seoil"}, "남동구" : {"서일자동차공업사" : "seoil"}, "부평구" : {"서일자동차공업사" : "seoil"}, "계양구" : {"서일자동차공업사" : "seoil"}, "서구" : {"서일자동차공업사" : "seoil"}, "강화군" : {"서일자동차공업사" : "seoil"}, "옹진군" : {"서일자동차공업사" : "seoil"} },
                    "광주광역시" : { "동구" : {"뉴중흥공업사" : "njh"}, "서구" : {"뉴중흥공업사" : "njh"}, "남구" : {"뉴중흥공업사" : "njh"}, "북구" : {"뉴중흥공업사" : "njh"}, "광산구" : {"뉴중흥공업사" : "njh"} },
                    "대전광역시" : { "동구" : {"태전공업사" : "tj"}, "중구" : {"태전공업사" : "tj"}, "서구" : {"태전공업사" : "tj"}, "유성구" : {"태전공업사" : "tj"}, "대덕구" : {"태전공업사" : "tj"} },
                    "울산광역시" : { "중구" : {"쌍용포항정비" : "ssy"} },
                    "세종특별자치시" : { "전체" : {"태전공업사" : "tj"} },
                    "경기도" : { "가평군" : {"동일공업사" : "dongil"}, "안산시" : {"1급서부중앙공업사" : "sb"}, "안양시" : {"1급서부중앙공업사" : "sb"}, "시흥시" : {"1급서부중앙공업사" : "sb"}, "군포시" : {"1급서부중앙공업사" : "sb"}, "고양시" : {"M모터스" : "M"}, "남양주시" : {"대성자동차공업사" : "ds"}, "의정부시" : {"대성자동차공업사" : "ds"}, "부천시" : {"1급 불루모터스" : "blue"}, "광명시" : {"서일자동차공업사" : "seoil"}, "양주시" : {"동일공업사" : "dongil"}, "포천시" : {"동일공업사" : "dongil"}, "동두천시" : {"동일공업사" : "dongil"}, "연천군" : {"동일공업사" : "dongil"}, "성남시" : {"메가모터스" : "mg"}, "광주시" : {"메가모터스" : "mg"}, "하남시" : {"메가모터스" : "mg"}, "구리시" : {"메가모터스" : "mg"}, "양평군" : {"메가모터스" : "mg"}, "과천시" : {"메가모터스" : "mg"}, "파주시" : {"부광모터스" : "bg"}, "김포시" : {"신영모터스" : "shin"}, "수원시" : {"제일공업사" : "sc"}, "용인시" : {"제일공업사" : "sc"}, "화성시" : {"제일공업사" : "sc"}, "오산시" : {"제일공업사" : "sc"}, "이천시" : {"제일공업사" : "sc"}, "의왕시" : {"제일공업사" : "sc"}, "여주시" : {"제일공업사" : "sc"}, "평택시" : {"한도하이테크" : "hd"}, "안성시" : {"한도하이테크" : "hd"} },
                    "강원도" : { "춘천시" : {"동일공업사" : "dongil"}, "원주시" : {"신범공업사" : "sb2"}, "강릉시" : {"우리자동차정비" : "wr"}, "동해시" : {"우리자동차정비" : "wr"}, "태백시" : {"우리자동차정비" : "wr"}, "속초시" : {"속초대명1급공업사" : "dm"}, "삼척시" : {"우리자동차정비" : "wr"}, "영월군" : {"신범공업사" : "sb2"}, "평창군" : {"신성1급자동차공업사" : "gangnam"}, "정선군" : {"우리자동차정비" : "wr"}, "철원군" : {"동일공업사" : "dongil"},  "인제군" : {"대명자동차공업사" : "dm"}, "고성군" : {"대명자동차공업사" : "dm"}, "양양군" : {"대명자동차공업사" : "dm"}  },
                    "충청북도" : { "제천시" : {"신범공업사" : "sb2"}, "단양군" : {"신범공업사" : "sb2"}, "청주시" : {"아진공업사" : "aj"}, "보은군" : {"아진공업사" : "aj"}, "증평군" : {"아진공업사" : "aj"}, "진천군" : {"아진공업사" : "aj"}, "충주시" : {"조운공업사" : "jown"}, "괴산군" : {"조운공업사" : "jown"}, "음성군" : {"조운공업사" : "jown"}, "옥천군" : {"태전공업사" : "tj"}, "영동군" : {"태전공업사" : "tj" }},
                    "충청남도" : { "보령시" : {"부여현대공업사" : "by"}, "논산시" : {"부여현대공업사" : "by"}, "부여군" : {"부여현대공업사" : "by"}, "서천군" : {"부여현대공업사" : "by"}, "청양군" : {"부여현대공업사" : "by"}, "서산시" : {"서산종압자동차정비" : "seosan"}, "당진시" : {"서산종압자동차정비" : "seosan"}, "홍성군" : {"서산종압자동차정비" : "seosan"}, "천안시" : {"충남자동차공업사" : "chungnam"}, "아산시" : {"충남자동차공업사" : "chungnam"}, "예산군" : {"충남자동차공업사" : "chungnam"}, "태안군" : {"충남자동차공업사" : "chungnam"}, "공주시" : {"태전공업사" : "tj"}, "계룡시" : {"태전공업사" : "tj"}, "금산군" : {"태전공업사" : "tj"} },
                    "전라북도" : { "군산시" : {"오라1급공업사" : "ora"}, "정읍시" : {"오라1급공업사" : "ora"}, "김제시" : {"오라1급공업사" : "ora"}, "부안군" : {"오라1급공업사" : "ora"}, "전주시" : {"우성공업사" : "wos"}, "익산시" : {"우성공업사" : "wos"}, "완주군" : {"우성공업사" : "wos"}, "진안군" : {"우성공업사" : "wos"}, "무주군" : {"우성공업사" : "wos"}, "장수군" : {"우성공업사" : "wos"}, "임실군" : {"우성공업사" : "wos"}, "남원시" : {"중흥자동차공업사" : "njh"}, "순창군" : {"중흥자동차공업사" : "njh"} },
                    "전라남도" : { "장흥군" : {"하당1급자동차공업사" : "hd1"}, "강진군" : {"하당1급자동차공업사" : "hd1"}, "해남군" : {"하당1급자동차공업사" : "hd1"}, "완도군" : {"하당1급자동차공업사" : "hd1"}, "진도군" : {"하당1급자동차공업사" : "hd1"}, "신안군" : {"하당1급자동차공업사" : "hd1"}, "나주시" : {"중흥자동차공업사" : "njh"}, "담양군" : {"중흥자동차공업사" : "njh"}, "곡성군" : {"중흥자동차공업사" : "njh"}, "구례군" : {"중흥자동차공업사" : "njh"}, "화순군" : {"중흥자동차공업사" : "njh"}, "함평군" : {"중흥자동차공업사" : "njh"}, "영광군" : {"중흥자동차공업사" : "njh"}, "장성군" : {"중흥자동차공업사" : "njh"}, "여수시" : {"진남공업사" : "jn"}, "순천시" : {"진남공업사" : "jn"}, "광양시" : {"진남공업사" : "jn"}, "고흥군" : {"진남공업사" : "jn"}, "보성군" : {"진남공업사" : "jn"}, "목포시" : {"하당1급자동차공업사" : "hd1"}, "영암군" : {"하당1급자동차공업사" : "hd1"}, "무안군" : {"하당1급자동차공업사" : "hd1"} },
                    "경상북도" : { "김천시" : {"신원모터스" : "sy"}, "구미시" : {"신원모터스" : "sy"}, "경산시" : {"신원모터스" : "sy"}, "군위군" : {"신원모터스" : "sy"}, "청도군" : {"신원모터스" : "sy"}, "고령군" : {"신원모터스" : "sy"}, "성주군" : {"신원모터스" : "sy"}, "칠곡군" : {"신원모터스" : "sy"}, "포항시" : {"쌍용포항정비" : "ssy"}, "경주시" : {"쌍용포항정비" : "ssy"}, "영천시" : {"쌍용포항정비" : "ssy"}, "청송군" : {"쌍용포항정비" : "ssy"}, "영덕군" : {"쌍용포항정비" : "ssy"}, "울릉군" : {"우리자동차정비" : "wr"}, "안동시" : {"프로모터스" : "pro"}, "영주시" : {"프로모터스" : "pro"}, "상주시" : {"프로모터스" : "pro"}, "문경시" : {"프로모터스" : "pro"}, "의성군" : {"프로모터스" : "pro"}, "영양군" : {"프로모터스" : "pro"}, "예천군" : {"프로모터스" : "pro"}, "봉화군" : {"프로모터스" : "pro"}, "울진군" : {"프로모터스" : "pro"} },
                    "경상남도" : { "김해시" : {"세창공업사" : "sh"}, "밀양시" : {"세창공업사" : "sh"}, "양산시" : {"세창공업사" : "sh"}, "진주시" : {"대운모터스" : "dw"}, "사천시" : {"대운모터스" : "dw"}, "의령군" : {"대운모터스" : "dw"}, "고성군" : {"대운모터스" : "dw"}, "하동군" : {"대운모터스" : "dw"}, "산청군" : {"대운모터스" : "dw"}, "통영시" : {"문성정비" : "ms"}, "거제시" : {"문성정비" : "ms"}, "창원시" : {"세창공업사" : "sh"}, "함안군" : {"세창공업사" : "sh"}, "창녕군" : {"세창공업사" : "sh"}, "합천군" : {"세창공업사" : "sh"}, "함양군" : {"신원모터스" : "sy"}, "거창군" : {"신원모터스" : "sy"}, "남해군" : {"진남공업사" : "jn"} },
                    "제주특별자치도" : { "전체" : {"조흥공업사" : "joh"} }
                },
            };

            var branchList = {
                "ds" : "서울시 도봉구 도봉로 150다길 42 대성자동차공업사 / 연락처 010-4310-9344",
                "gm" : "부산광역시 사상구 모덕로 27번길 50 대주모터스 / 연락처 010-3871-8633",
                "dh" : "경기도 부천시 오정동 805-4 대한모터스 / 연락처 010-3936-0150",
                "so" : "대구광역시 서구 중리동 1060-3 신원모터스 / 연락처 010-3871-8633",
                "mg" : "서울 성동구 성수이로 26길 19 (성수동2가) 메가모터스 / 연락처 010-3704-3028",
                "seoil" : "인천 남동구 논현 고잔로 130번길25 서일자동차공업사 / 연락처 010-5091-1007",
                "njh" : "광주 북구 중흥동 제봉로 277-1 뉴중흥공업사 / 연락처 010-3623-7799",
                "tj" : "대전 서구 월평동 127 태전공업사 / 연락처 010-3444-3069",
                "ssy" : "경북 포항시 북구 소티재로 66 쌍용포항정비 / 연락처 010-4533-5845",
                "gangnam" : "강원 춘천시 신동면 김유정로 1577 (주)강남일급정비공장/ 연락처 010-3802-1443",
                "sb" : "경기도 안산시 단원구 선이로4길 9 1급서부중앙공업사 / 연락처 010-6314-7537",
                "dongil" : "경기도 포천시 소홀읍 죽엽산로 28 동일공업사 / 연락처 010-8942-0001",
                "bg" : "경기도 파주시 월롱면 도감로 164 부광모터스 / 연락처 010-9269-7776",
                "shin" : "경기도 김포시 대곶면 수남로 57 신영모터스 / 연락처 010-5442-7516",
                "sc" : "경가도 수원시 권선구 매송고색로 804번길 21 제일공업사 / 연락처 010-6267-4985",
                "hd" : "경기도 평택시 이화로 359 한도하이테크 / 연락처 010-5264-8346",
                "sb2" : "충북 제천시 송학주천로 44 신범공업사 / 연락처 010-9409-7559",
                "wr" : "강원도 동해시 발한로 56 우리자동차정비 / 연락처 010-3554-4982",
                "hg" : "강원도 태백시 화전동 14-39 형제모터스 / 연락처 010-3277-8115",
                "dm" : "강원도 속초시 번영로 176 속초대명1급공업사 / 연락처 010-7362-6150",
                "aj" : "충북 청주시 흥덕구 사운로 359번길 24 아진공업사 / 연락처 010-5462-6050",
                 "jown" : "충북 충주시 금봉대로 424 조운공업사 / 연락처 010-4284-3100",
                "by" : "충남 부여군 규암면 흥수로 860 부여현대공업사 / 연락처 010-5437-0845",
                "seosan" : "충청남도 서산시 서해로 3197 서산종압자동차정비 / 연락처 010-6409-3870",
                "chungnam" : "충남 아산시 실옥동 346-5 충남자동차공업사 / 연락처 010-6421-0519",
                "ora" : "전북 김제시 교월동 벽골제로 853 오라1급공업사 / 연락처 010-3689-2772",
                "wos" : "전북 전주시 덕진구 서귀로 23길 우성공업사 / 연락처 010-9476-0057",
                "gang" : "전남 강진군 강진읍 해강로 1404 강진공업사 / 연락처 010-3462-3329",
                "jn" : "전남 여수시 둔덕8길 6 진남공업사 / 연락처 010-3623-8612",
                "hd1" : "전남 목포시 남악로 58번길 16 하당1급자동차공업사 / 연락처 010-5322-4757",
                "sy" : "대구 서구 국채보상로 20길 6 신원모터스 / 연락처 010-3525-9877",
                "pro" : "경북 안동시 앙실2길 13 프로모터스 / 연락처 010-9350-1115",
                "dw" : "경남 진주시 큰들로 126번길 7 대운모터스 / 연락처 010-8420-0112",
                "ms" : "경남 거제시 옥포 성안로 67 문성정비 / 연락처 010-5899-9525",
                "sh" : "경남 창원시 마산합포구 산호동 204-10 세창공업사 / 연락처 010-4848-3855",
                "joh" : "조흥공업사 / 연락처 010-3690-3336",
                "blue" : "경기도 부천시 석천로 477(삼정동) 1급 불루모터스 / 연락처 010-4541-2677",
                "M" : "경기도 고양시 일산동구 견달산로225번길 66 M모터스 / 연락처 010-4042-3689"
                
            }
            
            /*
              var area = {
                "수도권" :{
                    "서울특별시" : { "광진구" : {"자양동" : "Seoul"}},
                    "인천광역시" : { "미추홀구" : {"숭의1동" : "Incheon", "숭의2동" : "Incheon"}, "연수구" : {"연수1동" : "Incheon", "연수2동" : "Incheon", "연수3동" : "Incheon"} }
                },
            };

            var branchList = {
                "Incheon" : "인천광역시 연수구 연수3동 577 영남아파트 우리집,  010-5321-0093",
                "Seoul" : "서울특별시 광진구 자양동 797-5 승승재 우리집, 010-5321-0093"
            } */


            

            //초기화
            init(true, true, true);

            //권역 기본 생성
            var areaKeys1 = Object.keys(area);
            areaKeys1.forEach(function(Region){
                $(a1).append("<option value="+Region+">"+Region+"</option>");
            });

            //변경 이벤트
            $(document).on("change", a1, function(){
                init(false, true, true);
                var Region = $(this).val();
                var keys = Object.keys(area[Region]);
                keys.forEach(function(Do){
                    $(a2).append("<option value="+Do+">"+Do+"</option>");
                });
            }).on("change", a2, function(){
                init(false, false, true);
                var Region = $(a1).val();
                var Do = $(this).val();
                var keys = Object.keys(area[Region][Do]);
                keys.forEach(function(SiGunGu){
                    $(a3).append("<option value="+SiGunGu+">"+SiGunGu+"</option>");
                });
            }).on("change", a3, function(){
                var Region = $(a1).val();
                var Do = $(a2).val();
                var SiGunGu = $(this).val();
                var keys = Object.keys(area[Region][Do][SiGunGu]);
                keys.forEach(function(Dong){
                    $(a4).append("<option value="+area[Region][Do][SiGunGu][Dong]+">"+Dong+"</option>");
                });
            }).on("change", a4, function(){
                var Dong = $(this).val();
                $("#branch").text(branchList[Dong]);

            });

            function init(first, second, third){
                first ? $(a1).empty().append("<option value=''>선택</option>") : "";
                second ? $(a2).empty().append("<option value=''>선택</option>") : "";
                third ? $(a3).empty().append("<option value=''>선택</option>") : "";
                $(a4).empty().append("<option value=''>선택</option>");
            }
        }
    </script>

    
    
    
<div style= "text-align: center; margin-top:200px;">
    
<img src="/images/insurance.jpg" alt="" style="max-width:100%; height:auto;" />
    
    
</div>



